In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series,DataFrame

In [4]:
string_data=pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0]=None

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
from numpy import nan as NA

In [10]:
data=pd.Series([1,NA,3.5,NA,7])

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [14]:
cleaned=data.dropna()

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
#传入how='all'将只丢弃全为NA的那些行

In [19]:
data[4]=NA

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df=pd.DataFrame(np.random.randn(7,3))

In [23]:
df.iloc[:4,1]=NA

In [24]:
df.iloc[:2,2]=NA

In [25]:
df

          0         1         2
0  0.201881       NaN       NaN
1 -0.317349       NaN       NaN
2  0.227229       NaN  0.981681
3 -0.125083       NaN  0.314520
4  1.162654 -2.041886  0.669075
5 -0.862767 -1.547638  0.309246
6  1.014812 -1.677554 -0.110830

In [26]:
df.dropna()

          0         1         2
4  1.162654 -2.041886  0.669075
5 -0.862767 -1.547638  0.309246
6  1.014812 -1.677554 -0.110830

In [27]:
df.dropna(thresh=2)

          0         1         2
2  0.227229       NaN  0.981681
3 -0.125083       NaN  0.314520
4  1.162654 -2.041886  0.669075
5 -0.862767 -1.547638  0.309246
6  1.014812 -1.677554 -0.110830

In [28]:
df.fillna(0)

          0         1         2
0  0.201881  0.000000  0.000000
1 -0.317349  0.000000  0.000000
2  0.227229  0.000000  0.981681
3 -0.125083  0.000000  0.314520
4  1.162654 -2.041886  0.669075
5 -0.862767 -1.547638  0.309246
6  1.014812 -1.677554 -0.110830

In [29]:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.201881  0.500000  0.000000
1 -0.317349  0.500000  0.000000
2  0.227229  0.500000  0.981681
3 -0.125083  0.500000  0.314520
4  1.162654 -2.041886  0.669075
5 -0.862767 -1.547638  0.309246
6  1.014812 -1.677554 -0.110830

In [30]:
_=df.fillna(0,inplace=True)

In [31]:
df

          0         1         2
0  0.201881  0.000000  0.000000
1 -0.317349  0.000000  0.000000
2  0.227229  0.000000  0.981681
3 -0.125083  0.000000  0.314520
4  1.162654 -2.041886  0.669075
5 -0.862767 -1.547638  0.309246
6  1.014812 -1.677554 -0.110830

In [32]:
_=df.fillna(5,inplace=True)

In [33]:
df

          0         1         2
0  0.201881  0.000000  0.000000
1 -0.317349  0.000000  0.000000
2  0.227229  0.000000  0.981681
3 -0.125083  0.000000  0.314520
4  1.162654 -2.041886  0.669075
5 -0.862767 -1.547638  0.309246
6  1.014812 -1.677554 -0.110830

In [34]:
df=pd.DataFrame(np.random.randn(6,3))

In [35]:
df.iloc[2:,1]=NA

In [36]:
df.iloc[4:,2]=NA

In [37]:
df

          0         1         2
0  1.320266  0.093212  0.584495
1  0.528869  1.595460 -1.227510
2  1.663716       NaN -1.544465
3 -0.541929       NaN -1.159823
4 -1.053309       NaN       NaN
5  0.807412       NaN       NaN

In [38]:
df.fillna(method='ffill')

          0         1         2
0  1.320266  0.093212  0.584495
1  0.528869  1.595460 -1.227510
2  1.663716  1.595460 -1.544465
3 -0.541929  1.595460 -1.159823
4 -1.053309  1.595460 -1.159823
5  0.807412  1.595460 -1.159823

In [39]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  1.320266  0.093212  0.584495
1  0.528869  1.595460 -1.227510
2  1.663716  1.595460 -1.544465
3 -0.541929  1.595460 -1.159823
4 -1.053309       NaN -1.159823
5  0.807412       NaN -1.159823

In [40]:
data=pd.Series([1.,NA,3.5,NA,7])

In [41]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [42]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],
                   'k2':[1,1,2,3,3,4,4]})

In [43]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [44]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [47]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [48]:
data['v1']=range(7)

In [49]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [50]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [51]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
                   'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [52]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [53]:
meat_to_animal={'bacon':'pig','pulled pork':'pig','pastrami':'cow','honey ham':'pig','nova lox':'salmon'}

In [54]:
lowercased=data['food'].str.lower()

In [55]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [59]:
data['animal']=lowercased.map(meat_to_animal)

In [57]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     NaN
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [58]:
meat_to_animal={'bacon':'pig','pulled pork':'pig','pastrami':'cow','corned beef':'cow','honey ham':'pig','nova lox':'salmon'}

In [60]:
data['animal']=lowercased.map(meat_to_animal)

In [61]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [62]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [63]:
data=pd.Series([1.,-999,2.,-999.,-1000.,3.])

In [64]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [65]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [66]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [67]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [68]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [69]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),
                  index=['Ohio','Colorado','New York'],
                  columns=['one','two','three','four'])

In [70]:
transform=lambda x:x[:4].upper()

In [71]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [72]:
data.index=data.index.map(transform)

In [73]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [74]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [75]:
data.rename(index={'OHIO':'INDIANA'},
            columns={'three':'peekboo'})

         one  two  peekboo  four
INDIANA    0    1        2     3
COLO       4    5        6     7
NEW        8    9       10    11

In [76]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)

In [77]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [78]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]

In [79]:
bins=[18,25,35,60,100]

In [80]:
cats=pd.cut(ages,bins)

In [81]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [83]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [84]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [85]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [86]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [87]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']

In [88]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [89]:
data=np.random.rand(20)

In [90]:
pd.cut(data,4,precision=2)

[(0.52, 0.73], (0.32, 0.52], (0.11, 0.32], (0.73, 0.94], (0.52, 0.73], ..., (0.11, 0.32], (0.32, 0.52], (0.73, 0.94], (0.52, 0.73], (0.32, 0.52]]
Length: 20
Categories (4, interval[float64]): [(0.11, 0.32] < (0.32, 0.52] < (0.52, 0.73] < (0.73, 0.94]]

In [91]:
data=np.random.randn(1000)

In [92]:
cats=pd.qcut(data,4)

In [93]:
cats

[(-2.8049999999999997, -0.8], (-0.8, -0.0454], (-0.8, -0.0454], (0.697, 3.28], (-0.0454, 0.697], ..., (-0.0454, 0.697], (-2.8049999999999997, -0.8], (-0.0454, 0.697], (-0.0454, 0.697], (0.697, 3.28]]
Length: 1000
Categories (4, interval[float64]): [(-2.8049999999999997, -0.8] < (-0.8, -0.0454] < (-0.0454, 0.697] < (0.697, 3.28]]

In [94]:
pd.value_counts(cats)

(0.697, 3.28]                  250
(-0.0454, 0.697]               250
(-0.8, -0.0454]                250
(-2.8049999999999997, -0.8]    250
dtype: int64

In [95]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(-2.8049999999999997, -1.35], (-1.35, -0.0454], (-1.35, -0.0454], (-0.0454, 1.356], (-0.0454, 1.356], ..., (-0.0454, 1.356], (-2.8049999999999997, -1.35], (-0.0454, 1.356], (-0.0454, 1.356], (1.356, 3.28]]
Length: 1000
Categories (4, interval[float64]): [(-2.8049999999999997, -1.35] < (-1.35, -0.0454] < (-0.0454, 1.356] < (1.356, 3.28]]

In [96]:
data=pd.DataFrame(np.random.randn(1000,4))

In [97]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.052910    -0.023602    -0.011231    -0.003881
std       0.973660     0.976530     1.015495     0.967384
min      -3.327824    -3.372176    -2.918791    -2.884804
25%      -0.603125    -0.646194    -0.697872    -0.668975
50%       0.017979    -0.005324    -0.011312     0.011608
75%       0.709530     0.612737     0.639511     0.660086
max       2.889136     3.322813     3.154699     3.552291

In [98]:
col=data[2]

In [99]:
col[np.abs(col)>3]

145    3.154699
Name: 2, dtype: float64

In [100]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
2    0.623111  3.322813 -0.310181  0.015157
57  -0.491135 -3.082160  1.995331 -0.347112
145 -1.881984 -0.226636  3.154699 -0.065073
225 -1.558327 -1.188249 -0.183728  3.552291
291 -0.235742 -3.372176 -0.135339 -0.657636
388  0.875339  0.564487  0.862078  3.117737
398 -3.327824 -1.765916  1.138203 -0.662395

In [102]:
data[np.abs(data)>3]=np.sign(data)*3

In [103]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.053238    -0.023470    -0.011386    -0.004551
std       0.972575     0.974012     1.015024     0.965133
min      -3.000000    -3.000000    -2.918791    -2.884804
25%      -0.603125    -0.646194    -0.697872    -0.668975
50%       0.017979    -0.005324    -0.011312     0.011608
75%       0.709530     0.612737     0.639511     0.660086
max       2.889136     3.000000     3.000000     3.000000

In [104]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0  1.0
1  1.0 -1.0  1.0  1.0
2  1.0  1.0 -1.0  1.0
3  1.0  1.0  1.0  1.0
4 -1.0  1.0  1.0 -1.0

In [105]:
df=pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [106]:
sampler=np.random.permutation(5)

In [107]:
sampler

array([2, 1, 3, 4, 0])

In [108]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [109]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3

In [110]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

In [111]:
choices=pd.Series([5,7,-1,6,4])

In [112]:
draws=choices.sample(n=10,replace=True)

In [113]:
draws

1    7
3    6
4    4
4    4
4    4
1    7
3    6
4    4
1    7
1    7
dtype: int64

In [114]:
df=pd.DataFrame({'key':['b','b','a','c','a','b'],
                 'data':range(6)})

In [115]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [116]:
dummies=pd.get_dummies(df['key'],prefix='key')

In [118]:
df_with_dummy=df[['data']].join(dummies)

In [119]:
df_with_dummy

   data  key_a  key_b  key_c
0     0      0      1      0
1     1      0      1      0
2     2      1      0      0
3     3      0      0      1
4     4      1      0      0
5     5      0      1      0

In [120]:
mnames=['movie_id','title','genres']

In [122]:
movies=pd.read_table('D:\python\movielens\movies.dat',sep='::',header=None,names=mnames)

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.
D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [123]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [124]:
all_genres=[]

In [125]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [126]:
genres=pd.unique(all_genres)

In [127]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [128]:
zero_matrix=np.zeros((len(movies),len(genres)))

In [129]:
dummies=pd.DataFrame(zero_matrix,columns=genres)

In [130]:
gen=movies.genres[0]

In [131]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [132]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [133]:
for i,gen in enumerate(movies.genres):
    indices=dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices]=1

In [134]:
movies_windic=movies.join(dummies.add_prefix('Genre_'))

In [135]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [136]:
np.random.seed(12345)

In [137]:
values=np.random.rand(10)

In [138]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [139]:
bins=[0,0.2,0.4,0.6,0.8,1]

In [140]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [141]:
val='a,b,guido'

In [142]:
val.split(',')

['a', 'b', 'guido']

In [143]:
pieces=[x.strip() for x in val.split(',')]

In [144]:
pieces

['a', 'b', 'guido']

In [145]:
first,second,third=pieces

In [146]:
first+'::'+second+'::'+third

'a::b::guido'

In [147]:
'::'.join(pieces)

'a::b::guido'

In [148]:
'guido'in val

True

In [149]:
val.index(',')

1

In [150]:
val.find(':')

-1

In [151]:
val.index(':')

ValueError: substring not found

In [152]:
val.count(',')

2

In [153]:
val.replace(',','::')

'a::b::guido'

In [154]:
val.replace(',','')

'abguido'

In [155]:
import re

In [156]:
text="foo  bar\t baz  \tqux"

In [157]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [158]:
regex=re.compile('\s+')

In [159]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [160]:
regex.findall(text)

['  ', '\t ', '  \t']

In [161]:
text="""Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern=r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex=re.compile(pattern,flags=re.IGNORECASE)

In [162]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [163]:
m=regex.search(text)

In [164]:
m

In [165]:
text[m.start():m.end()]

'dave@google.com'

In [166]:
print(regex.match(text))

None

In [167]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [168]:
pattern=r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [169]:
regex=re.compile(pattern,flags=re.IGNORECASE)

In [170]:
m=regex.match('wesm@bright.net')

In [171]:
m.groups()

('wesm', 'bright', 'net')

In [173]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [174]:
print(regex.sub(r'Username:\1,Domain:\2,Suffix:\3',text))

Dave Username:dave,Domain:google,Suffix:com
Steve Username:steve,Domain:gmail,Suffix:com
Rob Username:rob,Domain:gmail,Suffix:com
Ryan Username:ryan,Domain:yahoo,Suffix:com

In [175]:
data={'Dave':'dave@google.com','Steve': 'steve@gmail.com', 'Rob':'rob@gmail.com','Wes':np.nan}

In [176]:
data=pd.Series(data)

In [177]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [178]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [179]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [180]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [181]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [182]:
matches=data.str.match(pattern,flags=re.IGNORECASE)

In [183]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [184]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [185]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [186]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object